{
  "Python": "Experiência no desenvolvimento de sistemas utilizando Python, com foco em automação, integração de sistemas e desenvolvimento de APIs. Uso do Django e Flask para criar backends robustos e escaláveis.",
  "Django": "Desenvolvimento de aplicações web completas utilizando o Django Web Framework, abrangendo o backend com Django Models (ORM), sistemas de autenticação e administração (Django Admin), e frontend com Django Templates. Implementação de funcionalidades como autenticação de usuários, gerenciamento de arquivos estáticos e dinâmicos, segurança, e otimização de consultas SQL. Criação de APIs com Django REST Framework (DRF), utilizando serializers, autenticação, e views baseadas em classe (CBVs) e função (FBVs). Realização de testes automatizados com Pytest, Unittest e integração de Selenium para testes funcionais.",
  "Django REST Framework (DRF)": "Desenvolvimento de APIs RESTful robustas e escaláveis utilizando o Django REST Framework. Implementação de autenticação (JWT, Token Authentication), criação de serializers para conversão de dados entre Python e JSON, além de views baseadas em classe (CBVs) e função (FBVs). Desenvolvimento de endpoints para consumo por aplicações front-end e mobile, além de gerenciamento de permissões de acesso.",
  "HTML e CSS": "Desenvolvimento de interfaces front-end utilizando HTML e CSS, criando layouts responsivos e interativos, com foco na usabilidade e na experiência do usuário.",
  "SQL com MySQL e MariaDB": "Experiência com bancos de dados relacionais MySQL e MariaDB, utilizando SQL para criação de tabelas, consultas e otimização de banco de dados, além de integração com Django ORM para manipulação de dados.",
  "Comandos Unix, Linux": "Utilização de comandos Unix/Linux para administração de servidores, automação de processos e gerenciamento de arquivos, garantindo eficiência nas operações de backend.",
  "Git e Github com chaves SSH": "Gestão de versionamento de código utilizando Git e GitHub, com configuração de chaves SSH para garantir segurança nas interações com repositórios remotos.",
  "API (Application Programming Interface)": "Desenvolvimento e integração de APIs (RESTful e SOAP), permitindo a comunicação eficiente entre sistemas e a reutilização de funcionalidades de software.",
  "Docker e Containers": "Utilização de Docker para criar ambientes isolados, facilitando o desenvolvimento e a implantação de aplicações. Criação e configuração de contêineres para garantir consistência nos ambientes de desenvolvimento e produção.",
  "ReactJS": "Experiência no desenvolvimento de aplicações interativas e escaláveis, utilizando componentes funcionais e de classe, hooks, gerenciamento de estado com Redux, além de integração com APIs externas.",
  "React-Native": "Experiência no desenvolvimento de aplicativos móveis nativos para iOS e Android utilizando React Native, incluindo navegação, integração com APIs, gerenciamento de estado e otimização de performance.",
  "JavaScript": "Experiência sólida em JavaScript, incluindo ES6+, promessas, async/await, manipulação de DOM e desenvolvimento de lógicas complexas em front-end.",
  "TailwindCSS": "Experiência com o uso do TailwindCSS para criar interfaces responsivas e customizáveis de forma rápida e eficiente, utilizando a abordagem de utilitários.",
  "Bootstrap": "Experiência no uso do Bootstrap para criar layouts responsivos e modernos, implementando componentes e personalizações para melhorar a experiência do usuário."
}
